## Terraform Plan

**Image:** `239388734812.dkr.ecr.us-east-1.amazonaws.com/iker-agents/dsp-agent:c1aed15`

<details>
<summary>Show Plan</summary>

```
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=239388734812]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.agent will be created
  + resource "aws_ecr_lifecycle_policy" "agent" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-1"
      + registry_id = (known after apply)
      + repository  = "iker-agents/dsp-agent"
    }

  # aws_ecr_repository.agent will be created
  + resource "aws_ecr_repository" "agent" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "iker-agents/dsp-agent"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all             = {
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.dsp_agent.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.dsp_agent.data.aws_iam_policy_document.bedrock_invoke will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bedrock_invoke" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "bedrock:InvokeModel",
              + "bedrock:InvokeModelWithResponseStream",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:bedrock:*:*:inference-profile/*",
              + "arn:aws:bedrock:*::foundation-model/*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.cloudwatch_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cloudwatch_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.ecr_pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr_pull" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.memory_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "memory_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "bedrock-agentcore:GetMemoryRecord",
              + "bedrock-agentcore:ListActors",
              + "bedrock-agentcore:ListMemoryRecords",
              + "bedrock-agentcore:ListSessions",
              + "bedrock-agentcore:RetrieveMemoryRecords",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "bedrock-agentcore:GetEvent",
              + "bedrock-agentcore:ListActors",
              + "bedrock-agentcore:ListEvents",
              + "bedrock-agentcore:ListSessions",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "bedrock-agentcore:CreateEvent",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.runtime_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "runtime_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "bedrock-agentcore.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.dsp_agent.data.aws_iam_policy_document.xray will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "xray" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.dsp_agent.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime.this will be created
  + resource "aws_bedrockagentcore_agent_runtime" "this" {
      + agent_runtime_arn         = (known after apply)
      + agent_runtime_id          = (known after apply)
      + agent_runtime_name        = "dsp_agent_tf"
      + agent_runtime_version     = (known after apply)
      + description               = "Agent runtime for dsp-agent-tf - managed by Terraform"
      + environment_variables     = {
          + "AGENT_NAME" = "DSP Agent (Terraform)"
          + "AWS_REGION" = (known after apply)
          + "MEMORY_ID"  = (known after apply)
          + "MODEL"      = "bedrock:global.anthropic.claude-sonnet-4-5-20250929-v1:0"
        }
      + lifecycle_configuration   = (known after apply)
      + region                    = "us-east-1"
      + role_arn                  = (known after apply)
      + tags                      = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                  = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + workload_identity_details = (known after apply)

      + agent_runtime_artifact {
          + container_configuration {
              + container_uri = (known after apply)
            }
        }

      + network_configuration {
          + network_mode = "PUBLIC"
        }
    }

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["canary"] will be created
  + resource "aws_bedrockagentcore_agent_runtime_endpoint" "this" {
      + agent_runtime_arn          = (known after apply)
      + agent_runtime_endpoint_arn = (known after apply)
      + agent_runtime_id           = (known after apply)
      + agent_runtime_version      = (known after apply)
      + description                = "dsp-agent-tf - Canary endpoint"
      + name                       = "canary"
      + region                     = "us-east-1"
      + tags                       = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                   = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
    }

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["dev"] will be created
  + resource "aws_bedrockagentcore_agent_runtime_endpoint" "this" {
      + agent_runtime_arn          = (known after apply)
      + agent_runtime_endpoint_arn = (known after apply)
      + agent_runtime_id           = (known after apply)
      + agent_runtime_version      = (known after apply)
      + description                = "dsp-agent-tf - Dev endpoint"
      + name                       = "dev"
      + region                     = "us-east-1"
      + tags                       = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                   = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
    }

  # module.dsp_agent.aws_bedrockagentcore_agent_runtime_endpoint.this["prod"] will be created
  + resource "aws_bedrockagentcore_agent_runtime_endpoint" "this" {
      + agent_runtime_arn          = (known after apply)
      + agent_runtime_endpoint_arn = (known after apply)
      + agent_runtime_id           = (known after apply)
      + agent_runtime_version      = (known after apply)
      + description                = "dsp-agent-tf - Prod endpoint"
      + name                       = "prod"
      + region                     = "us-east-1"
      + tags                       = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all                   = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
    }

  # module.dsp_agent.aws_bedrockagentcore_memory.this will be created
  + resource "aws_bedrockagentcore_memory" "this" {
      + arn                   = (known after apply)
      + event_expiry_duration = 90
      + id                    = (known after apply)
      + name                  = "dsp_agent_tf_memory"
      + region                = "us-east-1"
      + tags                  = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all              = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
    }

  # module.dsp_agent.aws_iam_role.runtime will be created
  + resource "aws_iam_role" "runtime" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dsp-agent-tf-runtime-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + tags_all              = {
          + "Agent"     = "dsp-agent-tf"
          + "ManagedBy" = "terraform"
          + "Project"   = "iker-agents"
        }
      + unique_id             = (known after apply)
    }

  # module.dsp_agent.aws_iam_role_policy.bedrock_invoke will be created
  + resource "aws_iam_role_policy" "bedrock_invoke" {
      + id          = (known after apply)
      + name        = "bedrock-invoke"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.dsp_agent.aws_iam_role_policy.cloudwatch_logs will be created
  + resource "aws_iam_role_policy" "cloudwatch_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.dsp_agent.aws_iam_role_policy.ecr_pull will be created
  + resource "aws_iam_role_policy" "ecr_pull" {
      + id          = (known after apply)
      + name        = "ecr-pull"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.dsp_agent.aws_iam_role_policy.memory_access will be created
  + resource "aws_iam_role_policy" "memory_access" {
      + id          = (known after apply)
      + name        = "memory-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.dsp_agent.aws_iam_role_policy.xray will be created
  + resource "aws_iam_role_policy" "xray" {
      + id          = (known after apply)
      + name        = "xray-tracing"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + DSPAgentStackTF         = {
      + CanaryEndpointArn = (known after apply)
      + DevEndpointArn    = (known after apply)
      + MemoryId          = (known after apply)
      + ProdEndpointArn   = (known after apply)
      + RuntimeArn        = (known after apply)
      + RuntimeId         = (known after apply)
    }
  + dsp_agent_endpoint_arns = {
      + canary = (known after apply)
      + dev    = (known after apply)
      + prod   = (known after apply)
    }
  + dsp_agent_memory_id     = (known after apply)
  + dsp_agent_runtime_arn   = (known after apply)
  + dsp_agent_runtime_id    = (known after apply)
  + ecr_repository_url      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @iker592, Action: `pull_request`*